package ex1_1;

public class Ex1_First {
	public static void main(String[] args) {
		System.out.println("hello world");
	}
	
	//주석
	//프로그램의 소스코드에 개발자의 의견이나 설명을 적어놓는 것
	//주석은 프로그램 소스에 삽입하더라도 프로그램의 수행에 전혀 
	//영향을 끼치지 않음
	//JVM에서 컴파일을 할 시 인식하지 못하는 코드이기 때문
	//주석으로 복잡한 코드의 설명을 잘 달아놓으면 이해하기 쉽고
	//다른 개발자가 코드를 해석하는데 도움이 된다
	
	//Task tag
	// TODO : 좀 더 최적화시킬 수 있을만한 구석이 있을때
	// 미래에 뭔가 의미있는 작업을 더 해야할 필요성을 느낄때 
	
	// FIXME : 문제가 있는 것이 확실하지만, 그걸 지금 당장
	//수정할 필요는 없을때
	 
	// XXX : 해당 부분에 대해서는 더 생각해볼 필요성이 있을때,
	//코드에서 문제가 일어날만한 부분을 강조 표기할때
	
	/*
	 *여러줄 
	 *주석이
	 *필요할 때
	 *사용
	 **/
	
	

	
}
