package ex2_value;

public class Ex1_Variable {
	//변수(Variable)
	//데이터를 담는 그릇
	
	//변수의 선언 (비어있는 그릇을 만드는 과정)
	//내가 어떤 타입의 데이터를 담을건지 미리 지정
	
	//자료형 변수명;
	
	//변수의 대입
	//변수명 = 데이터;
	
	//프로그래밍에서는 =은 같다가 아닌 
	//우측에서 값을 좌측에 대입하겠다 라는 의미
	
	//변수의 초기화(initialize)
	//초기화 -> 초기값을 지정한다는 의미
	
	//선언 + 대입
	//자료형 변수명 = 데이터;
	
	//변수명 명명 규칙
	//1. 변수명의 맨 앞에 숫자가 들어갈 수 없다
	//2. 영어의 대소문자를 구분한다.(Name과 name이랑 다른 변수로 인식)
	//3. 일반적으로 영어소문자로 시작을 한다
	//4. _를 제외하고 특수기호가 포함될 수 없다.
	//5. 이미 있는 키워드는 사용하면 안된다.(if, for, while,switch)
	//6. 변수의 이름으로 한글은 사용하지 말것
	
	//표기법
	//변수명은 문자 수의 제한이 없으므로 최대한
	//변수의 의미를 쉽게 파악할 수 있도록
	//구체적으로 명명하는 것이 좋다.
	
	//카멜표기법(camel case)
	//두번째 단어부터 첫글자를 대문자로 표기하는 방법
	//userName
	//phoneNumber
	
	//스네이크표기법(snake case)
	//모든 단어가 소문자로 시작하고, 단어와 단어 사이는
	//_로 연결한다
	//user_name
	//phone_number
	
}
